Pongkemon01/ServoCoordinator/Software/nuttx/boards/arm/stm32f7/coordinator/src/mpu9250.c
#define DMP_BANK                0x6D  /* Activates a specific bank in the DMP */
#define DMP_ADDRESS             0x6E  /* Set read/write pointer to a specific start address in specified DMP bank */
#define DMP_REG                 0x6F  /* Register in DMP from which to read or to which to write */
#define DMP_FW_START_H          0x70
#define DMP_FW_START_L          0x71

#define FIFO_COUNTH             0x72
#define FIFO_COUNTL             0x73
#define FIFO_R_W                0x74
#define WHO_AM_I_MPU9250        0x75 /* Should return 0x71 */
#define XA_OFFSET_H             0x77
#define XA_OFFSET_L             0x78
#define YA_OFFSET_H             0x7A
#define YA_OFFSET_L             0x7B
#define ZA_OFFSET_H             0x7D
#define ZA_OFFSET_L             0x7E

// Set initial input parameters
enum AK8963_Mode_e
{
    AK8963_MODE_PWRDN = 0,      /* Power down */
    AK8963_MODE_SINGLE = 1,     /* Single measurement */
    AK8963_MODE_CON8HZ = 2,     /* 8Hz continuous measurement */
    AK8963_MODE_CON100HZ = 6,   /* 100Hz continuous measurement */
    AK8963_MODE_EXTTRIG = 4,    /* External trigger measurement */
    AK8963_MODE_SELFTEST = 8,   /* Self-test */
    AK8963_MODE_ROMACC = 0xF,   /* Fuse ROM access */
};

enum AK8963_Resolution_e {
    MFS_14BITS = 0,             /* 0.6 mG per LSB */
    MFS_16BITS = 0x10,          /* 0.15 mG per LSB */
};

enum Accel_Scale_e {
    AFS_MASK = 0x18,
    AFS_2G = 0,
    AFS_4G = 8,
    AFS_8G = 0x10,
    AFS_16G = 0x18,
};

enum Gyro_Scale_e {
    GFS_MASK = 0x18,
    GFS_250DPS = 0,
    GFS_500DPS = 8,
    GFS_1000DPS = 0x10,
    GFS_2000DPS = 0x18,
};

#define G_SCALE     GFS_250DPS
#define A_SCALE     AFS_2G
#define M_RES       MFS_16BITS

/* The follwing factor must be set according to the scales and resolution above */
#define G_FACTOR    ( 250.0f / 32768.0f )
#define A_FACTOR    ( 2.0f / 32768.0f )
#define M_FACTOR    ( 10.0f * 4912.0f / 32760.0f )

#define F_PI        3.1415926535897932384626433832795029f
#define DEG_TO_RAD  ( F_PI / 180.0f )
#define RAD_TO_DEG  ( 180.0f / F_PI )

static const struct i2c_config_s   mpu_i2c_config =
{
    .frequency  = I2C_SPEED,
    .address    = MPU9250_ADDRESS,
    .addrlen    = 7                    /* 7-bit address */
};
static const struct i2c_config_s   compass_i2c_config =
{
    .frequency  = I2C_SPEED,
    .address    = AK8963_ADDRESS,
    .addrlen    = 7                    /* 7-bit address */
};
static struct i2c_master_s*  i2c_bus = NULL;

static uint32_t lastupdate = 0, tick_count = 0;
static float delta_s;    /* Time period used for integration */
static float fGyroBias[3] = {0, 0, 0}, fAccelBias[3] = {0, 0, 0}; // Bias corrections for gyro and accelerometer
static float fMagneticAdjFactor[3];
static float fMagnaticBias[3] = {0, 0, 0}, fMagnaticScale[3]  = {0, 0, 0};

static struct linear_accel_s /* linear acceleration (acceleration with gravity component subtracted) */
{
    float x;
    float y;
    float z;
}LinearAcel;

static float fQuaternion[4] = {1.0f, 0.0f, 0.0f, 0.0f};    // vector to hold quaternion

static struct work_s worker;

/************************************************************************************
 * Private Functions
 ************************************************************************************/
/* Helper function to represent "millis" function in Arduino system */
uint32_t millis(void)
{
    struct timespec tp;

    if (clock_gettime(CLOCK_MONOTONIC, &tp)) 
    {
        return 0;
    }

    return ( ( ( (uint32_t)tp.tv_sec ) * 1000 ) + ( tp.tv_nsec / 1000000 ) );
}


/************************************************************************************
 * Funtion : MPUWriteBytes and COMWriteBytes
 * Write bytes of data to MPU (address 0x68) or Compass (address 0x0C)
 ************************************************************************************/
static int MPUWrite1Byte( uint8_t addr, uint8_t data )
{
    uint8_t buffer[2];
    buffer[0] = addr;
    buffer[1] = data;
    return( i2c_write( i2c_bus, &mpu_i2c_config, buffer, 2 ) );
}
static int COMWrite1Byte( uint8_t addr, uint8_t data )
{
    uint8_t buffer[2];
    buffer[0] = addr;
    buffer[1] = data;
    return( i2c_write( i2c_bus, &compass_i2c_config, buffer, 2 ) );
}

/************************************************************************************
 * Funtion : MPUReadByte and COMReadBytes
 * Read bytes of data from MPU (address 0x68) or Compass (address 0x0C)
 ************************************************************************************/
static inline int MPUReadBytes( uint8_t addr, uint8_t* data, uint8_t len )
{
    return( i2c_writeread( i2c_bus, &mpu_i2c_config, &addr, 1, data, len ) );
}
static inline int COMReadBytes( uint8_t addr, uint8_t* data, uint8_t len )
{
    return( i2c_writeread( i2c_bus, &compass_i2c_config, &addr, 1, data, len ) );
}

/************************************************************************************
 * Funtions to read various sensor output
 ************************************************************************************/
static int ReadMPU9250Data( int16_t* destination )
{
    uint8_t rawData[14];  // x/y/z accel register data stored here
    int     retval;

    // Read the 14 raw data registers into data array
    retval = MPUReadBytes( ACCEL_XOUT_H, rawData, 14 );  
    if( retval != OK )
        return retval;

    destination[0] = ((int16_t)rawData[0] << 8) | rawData[1] ;  // Turn the MSB and LSB into a signed 16-bit value
    destination[1] = ((int16_t)rawData[2] << 8) | rawData[3] ;  
    destination[2] = ((int16_t)rawData[4] << 8) | rawData[5] ; 
    destination[3] = ((int16_t)rawData[6] << 8) | rawData[7] ;   
    destination[4] = ((int16_t)rawData[8] << 8) | rawData[9] ;  
    destination[5] = ((int16_t)rawData[10] << 8) | rawData[11] ;  
    destination[6] = ((int16_t)rawData[12] << 8) | rawData[13] ; 

    return OK;
}

/*------------------*/
static int ReadMagData( int16_t* destination )
{
    uint8_t rawData[7];  // x/y/z gyro register data, ST2 register stored here, must read ST2 at end of data acquisition
    int     retval;

    retval = COMReadBytes( AK8963_XOUT_L, rawData, 7 ); 
    if( retval != OK )
    {
        _err("Failed to read magneto meter data\n");
        return retval;
    }

    if( rawData[6] & 0x08 ) // Check if magnetic sensor overflow set, if not then report data
    {
        _err("Magneto overflow\n");
        return -EOVERFLOW;
    }
    else
    {
        destination[0] = ((int16_t)rawData[1] << 8) | rawData[0] ;  // Turn the MSB and LSB into a signed 16-bit value
        destination[1] = ((int16_t)rawData[3] << 8) | rawData[2] ;  // Data stored as little Endian
        destination[2] = ((int16_t)rawData[5] << 8) | rawData[4] ; 
        return OK;
    }
}

/*------------------*/
static int ReadTempData(void)
{
    uint8_t rawData[2];  // x/y/z gyro register data stored here
    int     retval;

