Pongkemon01/ServoCoordinator/Software/nuttx/boards/arm/stm32f7/coordinator/src/mpu9250.c
    // Read the 6 raw data registers into data array
    retval = MPUReadBytes( TEMP_OUT_H, rawData, 2 );  
    if( retval != OK )
        return retval;  /* Return a negative (a.k.a. error) back */

    return ((int)rawData[0] << 8) | rawData[1] ;  // Turn the MSB and LSB into a 16-bit value
}

/************************************************************************************
 * Funtion : InitAK8963 and InitMPU9250
 * Initialize devices.
 ************************************************************************************/
static int InitAK8963(void)
{    
    uint8_t data[3]; 
    int     retval;

    retval = COMWrite1Byte( AK8963_CNTL, AK8963_MODE_PWRDN ); /* Power down magnetometer */
    if( retval != OK )
        return retval;
    usleep(10000);

    /* First extract the factory calibration for each magnetometer axis */
    retval = COMWrite1Byte( AK8963_CNTL, AK8963_MODE_ROMACC ); /* Gain access to fuse ROM data */
    if( retval != OK )
        return retval;
    usleep(10000);

    retval = COMReadBytes( AK8963_ASAX, data, 3 ); /* Read the x-, y-, and z-axis calibration values */
    if( retval != OK )
        return retval;
    fMagneticAdjFactor[0] = (float)( data[0] - 128 )/256. + 1.;   /* Setting the adjustment factor values */
    fMagneticAdjFactor[1] = (float)( data[1] - 128 )/256. + 1.;  
    fMagneticAdjFactor[2] = (float)( data[2] - 128 )/256. + 1.; 

    retval = COMWrite1Byte( AK8963_CNTL, AK8963_MODE_PWRDN ); /* Power down magnetometer */
    if( retval != OK )
        return retval;
    usleep(10000);

    /* Configure the magnetometer for 100Hz continous read with 16-bit resolution */
    return( COMWrite1Byte( AK8963_CNTL, ( AK8963_MODE_CON100HZ | M_RES ) ) );
}

/***********************************************************************************/
static int InitMPU9250(void)
{
    int     retval;

    /* wake up device */
    retval = MPUWrite1Byte( PWR_MGMT_1, 0 ); /* Clear sleep mode bit (6), enable all sensors */
    if( retval != OK )
        return retval;
    usleep(10000); /* Wait for all registers to reset */

    /* get stable time source */
    retval = MPUWrite1Byte( PWR_MGMT_1, 1 ); /* Auto select clock source to be PLL */
    if( retval != OK )
        return retval;
    usleep(10000); /* Wait for all registers to reset */
  
    /* Configure Gyro, Thermometer, and accelerometer to 1 kHz sampling rate
    * Disable FSYNC and set thermometer and gyro bandwidth to 41 and 42 Hz, 
    * respectively; minimum delay time for this setting is 5.9 ms, which means
    * sensor fusion update rates cannot be higher than 1 / 0.0059 = 170 Hz
    * DLPF_CFG = bits 2:0 = 011; this limits the sample rate to 1000 Hz for both
    */
    retval = MPUWrite1Byte( CONFIG, 0x03 );
    if( retval != OK )
        return retval;
 
    /* Set gyroscope full scale range. Range selects FS_SEL and GFS_SEL are 0 - 3 */
    retval = MPUWrite1Byte( GYRO_CONFIG, G_SCALE );
    if( retval != OK )
        return retval;

    /* Set accelerometer full-scale range configuration */
    retval = MPUWrite1Byte( ACCEL_CONFIG, A_SCALE );
    if( retval != OK )
        return retval;

    /* Set accelerometer sample rate configuration to 1 kHz with bandwidth of 44.8 Hz */
    retval = MPUWrite1Byte( ACCEL_CONFIG2, 0x03 );
    if( retval != OK )
        return retval;

    /* Set sample rate = gyroscope output rate/(1 + SMPLRT_DIV) */
    retval = MPUWrite1Byte( SMPLRT_DIV, ( 1000 / SAMPLE_RATE ) - 1 );
    if( retval != OK )
        return retval;
  
    /* The accelerometer, gyro, and thermometer are set to 1 kHz sample rates, 
     * but all these rates are further reduced further by the SMPLRT_DIV setting to
     * match with the SAMPLE_RATE */

    /* Enable I2C bypass mode by setting I2C_BYPASS_EN so additional chips 
     * can join the I2C bus and all can be controlled directly.
     */
    retval = MPUWrite1Byte( INT_PIN_CFG, 0x02 ); /* Cuurently we don't have interrupt */
    if( retval != OK )
        return retval;

    /* Initialize the magnetometer AK8963 */
    return( InitAK8963() );
}

/************************************************************************************
 * Accelerometer and gyroscope self test; check calibration with respect to
 * factory settings. It returns percent deviation from factory trim values.
 * +/- 14 or less deviation is a pass
 ************************************************************************************/
static void MPUSelfTest( float * deviation ) /* deviation must be 6-element array */
{
    uint8_t rawData[6] = {0, 0, 0, 0, 0, 0};
    uint8_t selfTest[6];
    int32_t gAvg[3] = {0}, aAvg[3] = {0}, aSTAvg[3] = {0}, gSTAvg[3] = {0};
    float factoryTrim[6];
    uint8_t FS = 0;
    int     ii;
   
    MPUWrite1Byte( SMPLRT_DIV, 0x00 );    // Set gyro sample rate to 1 kHz
    MPUWrite1Byte( CONFIG, 0x02 );        // Set gyro sample rate to 1 kHz and DLPF to 92 Hz
    MPUWrite1Byte( GYRO_CONFIG, FS<<3 );  // Set full scale range for the gyro to 250 dps
    MPUWrite1Byte( ACCEL_CONFIG2, 0x02 ); // Set accelerometer rate to 1 kHz and bandwidth to 92 Hz
    MPUWrite1Byte( ACCEL_CONFIG, FS<<3 ); // Set full scale range for the accelerometer to 2 g

    for( ii = 0; ii < 200; ii++ ) 
    { 
        /* get average current values of gyro and acclerometer */
  
        MPUReadBytes( ACCEL_XOUT_H, rawData, 6 );        // Read the six raw data registers into data array
        aAvg[0] += (int16_t)(((int16_t)rawData[0] << 8) | rawData[1]) ;  // Turn the MSB and LSB into a signed 16-bit value
        aAvg[1] += (int16_t)(((int16_t)rawData[2] << 8) | rawData[3]) ;  
        aAvg[2] += (int16_t)(((int16_t)rawData[4] << 8) | rawData[5]) ; 
  
        MPUReadBytes( GYRO_XOUT_H, rawData, 6 );       // Read the six raw data registers sequentially into data array
        gAvg[0] += (int16_t)(((int16_t)rawData[0] << 8) | rawData[1]) ;  // Turn the MSB and LSB into a signed 16-bit value
        gAvg[1] += (int16_t)(((int16_t)rawData[2] << 8) | rawData[3]) ;  
        gAvg[2] += (int16_t)(((int16_t)rawData[4] << 8) | rawData[5]) ; 
    }
  
