Pongkemon01/ServoCoordinator/Software/nuttx/boards/arm/stm32f7/coordinator/src/mpu9250.c
    for ( ii =0; ii < 3; ii++ ) 
    {  /* Get average of 200 values and store as average current readings */
        aAvg[ii] /= 200;
        gAvg[ii] /= 200;
    }
  
    /* Configure the accelerometer for self-test */
    MPUWrite1Byte( ACCEL_CONFIG, 0xE0 ); // Enable self test on all three axes and set accelerometer range to +/- 2 g
    MPUWrite1Byte( GYRO_CONFIG,  0xE0 ); // Enable self test on all three axes and set gyro range to +/- 250 degrees/s
    usleep(25000);  // Delay a while to let the device stabilize

    for( ii = 0; ii < 200; ii++) 
    { 
        /* get average self-test values of gyro and acclerometer */
  
        MPUReadBytes( ACCEL_XOUT_H, rawData, 6 );        // Read the six raw data registers into data array
        aSTAvg[0] += (int16_t)(((int16_t)rawData[0] << 8) | rawData[1]) ;  // Turn the MSB and LSB into a signed 16-bit value
        aSTAvg[1] += (int16_t)(((int16_t)rawData[2] << 8) | rawData[3]) ;  
        aSTAvg[2] += (int16_t)(((int16_t)rawData[4] << 8) | rawData[5]) ; 
  
        MPUReadBytes( GYRO_XOUT_H, rawData, 6 );       // Read the six raw data registers sequentially into data array
        gSTAvg[0] += (int16_t)(((int16_t)rawData[0] << 8) | rawData[1]) ;  // Turn the MSB and LSB into a signed 16-bit value
        gSTAvg[1] += (int16_t)(((int16_t)rawData[2] << 8) | rawData[3]) ;  
        gSTAvg[2] += (int16_t)(((int16_t)rawData[4] << 8) | rawData[5]) ; 
    }
  
    for ( ii =0; ii < 3; ii++ ) 
    {  /* Get average of 200 values and store as average self-test readings */
        aSTAvg[ii] /= 200;
        gSTAvg[ii] /= 200;
    }   
  
    /* Configure the gyro and accelerometer for normal operation */
    MPUWrite1Byte( ACCEL_CONFIG, 0x00 );  
    MPUWrite1Byte( GYRO_CONFIG,  0x00 );  
    usleep(25000);  // Delay a while to let the device stabilize
   
    /* Retrieve accelerometer and gyro factory Self-Test Code from USR_Reg */
    MPUReadBytes( SELF_TEST_X_ACCEL, &(selfTest[0]), 1 ); // X-axis accel self-test results
    MPUReadBytes( SELF_TEST_Y_ACCEL, &(selfTest[1]), 1 ); // Y-axis accel self-test results
    MPUReadBytes( SELF_TEST_Z_ACCEL, &(selfTest[2]), 1 ); // Z-axis accel self-test results
    MPUReadBytes( SELF_TEST_X_GYRO, &(selfTest[3]), 1 );  // X-axis gyro self-test results
    MPUReadBytes( SELF_TEST_Y_GYRO, &(selfTest[4]), 1 );  // Y-axis gyro self-test results
    MPUReadBytes( SELF_TEST_Z_GYRO, &(selfTest[5]), 1 );  // Z-axis gyro self-test results

    /* Retrieve factory self-test value from self-test code reads */
    factoryTrim[0] = (float)(2620/1<<FS)*(powf( 1.01f , ((float)selfTest[0] - 1.0f) )); // FT[Xa] factory trim calculation
    factoryTrim[1] = (float)(2620/1<<FS)*(powf( 1.01f , ((float)selfTest[1] - 1.0f) )); // FT[Ya] factory trim calculation
    factoryTrim[2] = (float)(2620/1<<FS)*(powf( 1.01f , ((float)selfTest[2] - 1.0f) )); // FT[Za] factory trim calculation
    factoryTrim[3] = (float)(2620/1<<FS)*(powf( 1.01f , ((float)selfTest[3] - 1.0f) )); // FT[Xg] factory trim calculation
    factoryTrim[4] = (float)(2620/1<<FS)*(powf( 1.01f , ((float)selfTest[4] - 1.0f) )); // FT[Yg] factory trim calculation
    factoryTrim[5] = (float)(2620/1<<FS)*(powf( 1.01f , ((float)selfTest[5] - 1.0f) )); // FT[Zg] factory trim calculation
 
    /* Report results as a ratio of (STR - FT)/FT; the change from Factory Trim of the Self-Test Response
     * To get percent, must multiply by 100
     */
    for ( ii = 0; ii < 3; ii++ ) 
    {
        deviation[ii]   = 100.0f*((float)(aSTAvg[ii] - aAvg[ii]))/factoryTrim[ii] - 100.0f;   // Report percent differences
        deviation[ii+3] = 100.0f*((float)(gSTAvg[ii] - gAvg[ii]))/factoryTrim[ii+3] - 100.0f; // Report percent differences
   }
}

/************************************************************************************
 * Function which accumulates gyro and accelerometer data after device initialization.
 * It calculates the average of the at-rest readings and then loads the resulting
 * offsets into accelerometer and gyro bias registers.
 ************************************************************************************/
static void CalibrateAccelGyro(void)
{  
    uint8_t data[12]; // data array to hold accelerometer and gyro x, y, z, data
    uint16_t ii, packet_count, fifo_count;
    int32_t gyro_bias[3]  = {0, 0, 0}, accel_bias[3] = {0, 0, 0};
    int32_t accel_bias_reg[3] = {0, 0, 0}; // A place to hold the factory accelerometer trim biases
    uint8_t mask_bit[3] = {0, 0, 0}; // Define array to hold mask bit for each accelerometer bias axis
 
    // reset device
    MPUWrite1Byte ( PWR_MGMT_1, 0x80 ); // Write a one to bit 7 reset bit; toggle reset device
    usleep( 10000 );
   
    // get stable time source; Auto select clock source to be PLL gyroscope reference if ready 
    // else use the internal oscillator, bits 2:0 = 001
    MPUWrite1Byte( PWR_MGMT_1, 0x01 );  
    MPUWrite1Byte( PWR_MGMT_2, 0x00 );
    usleep( 20000 );                                    

    // Configure device for bias calculation
    MPUWrite1Byte( INT_ENABLE, 0x00 );   // Disable all interrupts
    MPUWrite1Byte( FIFO_EN, 0x00 );      // Disable FIFO
    MPUWrite1Byte( PWR_MGMT_1, 0x00 );   // Turn on internal clock source
    MPUWrite1Byte( I2C_MST_CTRL, 0x00 ); // Disable I2C master
    MPUWrite1Byte( USER_CTRL, 0x00 );    // Disable FIFO and I2C master modes
    MPUWrite1Byte( USER_CTRL, 0x0C );    // Reset FIFO and DMP
    usleep(1500);
  
    // Configure MPU6050 gyro and accelerometer for bias calculation
    MPUWrite1Byte( CONFIG, 0x01 );      // Set low-pass filter to 188 Hz
    MPUWrite1Byte( SMPLRT_DIV, 0x00 );  // Set sample rate to 1 kHz
    MPUWrite1Byte( GYRO_CONFIG, 0x00 );  // Set gyro full-scale to 250 degrees per second, maximum sensitivity
    MPUWrite1Byte( ACCEL_CONFIG, 0x00 ); // Set accelerometer full-scale to 2 g, maximum sensitivity

    // Configure FIFO to capture accelerometer and gyro data for bias calculation
    MPUWrite1Byte( USER_CTRL, 0x40 );   // Enable FIFO  
    MPUWrite1Byte( FIFO_EN, 0x78 );     // Enable gyro and accelerometer sensors for FIFO  (max size 512 bytes in MPU-9150)
    usleep(40000); // accumulate 40 samples in 40 milliseconds = 480 bytes

