Pongkemon01/ServoCoordinator/Software/nuttx/boards/arm/stm32f7/coordinator/src/mpu9250.c
    // at 100 Hz ODR, new mag data is available every 10 ms
    for(ii = 0; ii < 1500; ii++) 
    {
        ReadMagData( mag_temp );  // Read the mag data   
        for (int jj = 0; jj < 3; jj++) 
        {
            if(mag_temp[jj] > mag_max[jj]) 
                mag_max[jj] = mag_temp[jj];
            if(mag_temp[jj] < mag_min[jj]) 
                mag_min[jj] = mag_temp[jj];
        }
        usleep(12000);  // at 100 Hz ODR, new mag data is available every 10 ms
    }

    // Get hard iron correction
    mag_bias[0]  = (mag_max[0] + mag_min[0])/2;  // get average x mag bias in counts
    mag_bias[1]  = (mag_max[1] + mag_min[1])/2;  // get average y mag bias in counts
    mag_bias[2]  = (mag_max[2] + mag_min[2])/2;  // get average z mag bias in counts
    
    fMagnaticBias[0] = ( (float)mag_bias[0] ) * M_FACTOR * fMagneticAdjFactor[0];  // save mag biases in G for main program
    fMagnaticBias[1] = ( (float)mag_bias[1] ) * M_FACTOR * fMagneticAdjFactor[1];   
    fMagnaticBias[2] = ( (float)mag_bias[2] ) * M_FACTOR * fMagneticAdjFactor[2];  
       
    // Get soft iron correction estimate
    mag_scale[0]  = (mag_max[0] - mag_min[0])/2;  // get average x axis max chord length in counts
    mag_scale[1]  = (mag_max[1] - mag_min[1])/2;  // get average y axis max chord length in counts
    mag_scale[2]  = (mag_max[2] - mag_min[2])/2;  // get average z axis max chord length in counts

    avg_rad = mag_scale[0] + mag_scale[1] + mag_scale[2];
    avg_rad /= 3.0;

    fMagnaticScale[0] = avg_rad/((float)mag_scale[0]);
    fMagnaticScale[1] = avg_rad/((float)mag_scale[1]);
    fMagnaticScale[2] = avg_rad/((float)mag_scale[2]);
}

/************************************************************************************
 * Implementation of Sebastian Madgwick's "...efficient orientation filter for... 
 * inertial/magnetic sensor arrays" (see http://www.x-io.co.uk/category/open-source/ 
 * for examples and more details) which fuses acceleration, rotation rate, 
 * and magnetic moments to produce a quaternion-based estimate of absolute
 * device orientation -- which can be converted to yaw, pitch, and roll. Useful for 
 * stabilizing quadcopters, etc. The performance of the orientation filter is at least 
 * as good as conventional Kalman-based filtering algorithms but is much less 
 * computationally intensive ---it can be performed on a 3.3 V Pro Mini operating 
 * at 8 MHz!
 ************************************************************************************/

/* global constants for 9 DoF fusion and AHRS (Attitude and Heading Reference System) */
/* 
 * There is a tradeoff in the beta parameter between accuracy and response speed.
 * In the original Madgwick study, beta of 0.041 (corresponding to GyroMeasError 
 * of 2.7 degrees/s) was found to give optimal accuracy. However, with this value, 
 * the LSM9SD0 response time is about 10 seconds to a stable initial quaternion.
 * Subsequent changes also require a longish lag time to a stable output, 
 * not fast enough for a quadcopter or robot car! By increasing beta (GyroMeasError) 
 * by about a factor of fifteen, the response time constant is reduced to ~2 sec
 * I haven't noticed any reduction in solution accuracy. This is essentially 
 * the I coefficient in a PID control sense; the bigger the feedback coefficient, 
 *the faster the solution converges, usually at the expense of accuracy. 
 * In any case, this is the free parameter in the Madgwick filtering and fusion scheme.
 */
//static float beta = sqrt(3.0f / 4.0f) * GyroMeasError;   // compute beta
static float beta = 40.0f * DEG_TO_RAD * 0.866f;   // gyroscope measurement error in rads/s (start at 40 deg/s)
/* compute zeta */
/* the other free parameter in the Madgwick scheme usually set to a small or zero value */
//static float zeta = sqrt(3.0f / 4.0f) * GyroMeasDrift;   
//static float zeta = 0.866 * 0.0f  * DEG_TO_RAD;   // gyroscope measurement drift in rad/s/s (start at 0.0 deg/s/s)

/*-----------------------------------------------------------------------------------
 * Helper function : Fast inverse square-root ( i.e., 1/sqrt(x) )
 * See: http://en.wikipedia.org/wiki/Fast_inverse_square_root
 *----------------------------------------------------------------------------------*/
static float InvSqrt( float x )
{
    float halfx = 0.5f * x;
    union {
        float f;
        uint32_t i;
    } conv = {x};       /* evil floating point bit level hacking */

    conv.i = 0x5f3759df - ( conv.i >> 1 ); /* 0x5f3759df is just a magic number */

    /* The next line can be repeated any number of times to increase accuracy */
    conv.f *= ( 1.5f - ( halfx * conv.f * conv.f ) );
    conv.f *= ( 1.5f - ( halfx * conv.f * conv.f ) ); /* 2nd iteration to improve accuracy */
    return conv.f;
}

/*-----------------------------------------------------------------------------------
 * Helper function : Fast square-root
 * See: https://github.com/zrho/Carbon/blob/master/libc/src/math/sqrt.c
 *----------------------------------------------------------------------------------*/
static float FastSqrt( float x )
{
    int32_t i;
    float y;

    /* Floats + bit manipulation = +inf fun! */
    i = *((int32_t *) & x);
    i = 0x1fc00000 + (i >> 1);
    y = *((float *)&i);

    /* The next line can be repeated any number of times to increase accuracy */
    y = 0.5f * (y + x / y);
    y = 0.5f * (y + x / y); /* 2nd iteration to improve accuracy */

    return y;
}

static void MadgwickQuaternionUpdate(float ax, float ay, float az, float gx, float gy, float gz, float mx, float my, float mz)
{
    float q1 = fQuaternion[0], q2 = fQuaternion[1];
    float q3 = fQuaternion[2], q4 = fQuaternion[3];   // short name local variable for readability
    float norm;
    float hx, hy, _2bx, _2bz;
    float s1, s2, s3, s4;
    float qDot1, qDot2, qDot3, qDot4;

    // Auxiliary variables to avoid repeated arithmetic
    float _2q1mx;
    float _2q1my;
    float _2q1mz;
    float _2q2mx;
    float _4bx;
    float _4bz;
    float _2q1 = 2.0f * q1;
    float _2q2 = 2.0f * q2;
    float _2q3 = 2.0f * q3;
    float _2q4 = 2.0f * q4;
    float _2q1q3 = 2.0f * q1 * q3;
    float _2q3q4 = 2.0f * q3 * q4;
    float q1q1 = q1 * q1;
    float q1q2 = q1 * q2;
    float q1q3 = q1 * q3;
    float q1q4 = q1 * q4;
    float q2q2 = q2 * q2;
    float q2q3 = q2 * q3;
    float q2q4 = q2 * q4;
    float q3q3 = q3 * q3;
    float q3q4 = q3 * q4;
    float q4q4 = q4 * q4;

    // Normalise accelerometer measurement
    if( (ax == 0) && (ay == 0) && (az == 0) )
        return; // handle NaN
    norm = InvSqrt(ax * ax + ay * ay + az * az);
    ax *= norm;
    ay *= norm;
    az *= norm;

    // Normalise magnetometer measurement
    if( (mx == 0) && (my == 0) && (mz == 0) )
        return; // handle NaN
    norm = InvSqrt(mx * mx + my * my + mz * mz);
    mx *= norm;
    my *= norm;
    mz *= norm;

