Pongkemon01/ServoCoordinator/Software/nuttx/boards/arm/stm32f7/coordinator/src/mpu9250.c
    // Reference direction of Earth's magnetic field
    _2q1mx = 2.0f * q1 * mx;
    _2q1my = 2.0f * q1 * my;
    _2q1mz = 2.0f * q1 * mz;
    _2q2mx = 2.0f * q2 * mx;
    hx = mx * q1q1 - _2q1my * q4 + _2q1mz * q3 + mx * q2q2 + _2q2 * my * q3 + _2q2 * mz * q4 - mx * q3q3 - mx * q4q4;
    hy = _2q1mx * q4 + my * q1q1 - _2q1mz * q2 + _2q2mx * q3 - my * q2q2 + my * q3q3 + _2q3 * mz * q4 - my * q4q4;
    _2bx = FastSqrt(hx * hx + hy * hy);
    _2bz = -_2q1mx * q3 + _2q1my * q2 + mz * q1q1 + _2q2mx * q4 - mz * q2q2 + _2q3 * my * q4 - mz * q3q3 + mz * q4q4;
    _4bx = 2.0f * _2bx;
    _4bz = 2.0f * _2bz;

    // Gradient decent algorithm corrective step
    s1 = -_2q3 * (2.0f * q2q4 - _2q1q3 - ax) + _2q2 * (2.0f * q1q2 + _2q3q4 - ay) - _2bz * q3 * (_2bx * (0.5f - q3q3 - q4q4) + _2bz * (q2q4 - q1q3) - mx) + (-_2bx * q4 + _2bz * q2) * (_2bx * (q2q3 - q1q4) + _2bz * (q1q2 + q3q4) - my) + _2bx * q3 * (_2bx * (q1q3 + q2q4) + _2bz * (0.5f - q2q2 - q3q3) - mz);
    s2 = _2q4 * (2.0f * q2q4 - _2q1q3 - ax) + _2q1 * (2.0f * q1q2 + _2q3q4 - ay) - 4.0f * q2 * (1.0f - 2.0f * q2q2 - 2.0f * q3q3 - az) + _2bz * q4 * (_2bx * (0.5f - q3q3 - q4q4) + _2bz * (q2q4 - q1q3) - mx) + (_2bx * q3 + _2bz * q1) * (_2bx * (q2q3 - q1q4) + _2bz * (q1q2 + q3q4) - my) + (_2bx * q4 - _4bz * q2) * (_2bx * (q1q3 + q2q4) + _2bz * (0.5f - q2q2 - q3q3) - mz);
    s3 = -_2q1 * (2.0f * q2q4 - _2q1q3 - ax) + _2q4 * (2.0f * q1q2 + _2q3q4 - ay) - 4.0f * q3 * (1.0f - 2.0f * q2q2 - 2.0f * q3q3 - az) + (-_4bx * q3 - _2bz * q1) * (_2bx * (0.5f - q3q3 - q4q4) + _2bz * (q2q4 - q1q3) - mx) + (_2bx * q2 + _2bz * q4) * (_2bx * (q2q3 - q1q4) + _2bz * (q1q2 + q3q4) - my) + (_2bx * q1 - _4bz * q3) * (_2bx * (q1q3 + q2q4) + _2bz * (0.5f - q2q2 - q3q3) - mz);
    s4 = _2q2 * (2.0f * q2q4 - _2q1q3 - ax) + _2q3 * (2.0f * q1q2 + _2q3q4 - ay) + (-_4bx * q4 + _2bz * q2) * (_2bx * (0.5f - q3q3 - q4q4) + _2bz * (q2q4 - q1q3) - mx) + (-_2bx * q1 + _2bz * q3) * (_2bx * (q2q3 - q1q4) + _2bz * (q1q2 + q3q4) - my) + _2bx * q2 * (_2bx * (q1q3 + q2q4) + _2bz * (0.5f - q2q2 - q3q3) - mz);
    norm = InvSqrt(s1 * s1 + s2 * s2 + s3 * s3 + s4 * s4);    // normalise step magnitude
    s1 *= norm;
    s2 *= norm;
    s3 *= norm;
    s4 *= norm;

    // Compute rate of change of quaternion
    qDot1 = 0.5f * (-q2 * gx - q3 * gy - q4 * gz) - beta * s1;
    qDot2 = 0.5f * (q1 * gx + q3 * gz - q4 * gy) - beta * s2;
    qDot3 = 0.5f * (q1 * gy - q2 * gz + q4 * gx) - beta * s3;
    qDot4 = 0.5f * (q1 * gz + q2 * gy - q3 * gx) - beta * s4;

    // Integrate to yield quaternion
    q1 += qDot1 * delta_s;
    q2 += qDot2 * delta_s;
    q3 += qDot3 * delta_s;
    q4 += qDot4 * delta_s;
    norm = InvSqrt(q1 * q1 + q2 * q2 + q3 * q3 + q4 * q4);    // normalise quaternion
    fQuaternion[0] = q1 * norm;
    fQuaternion[1] = q2 * norm;
    fQuaternion[2] = q3 * norm;
    fQuaternion[3] = q4 * norm;
}

/************************************************************************************
 * The call-back function for updateing IMU data (i.e., platform pose
 * and linear acceleration).
 * This function should be called on every SAMPLE_RATE trig period.
 ************************************************************************************/
static void UpdateData(FAR void *arg)
{
    uint32_t now;
    int16_t rawAcelTempGy[7], rawMag[3];
    float a31, a32, a33;
    float ax, ay, az, gx, gy, gz, mx, my, mz; // variables to hold latest sensor data values 
    int     retval;

    /* Re-enable sensor update */
    if( work_queue(MPU_WORK_QUEUE, &worker, UpdateData, NULL, SAMPLE_PERIOD) != OK )
    {
        _err("Unable to register IMU to work queue\n");
    }

    retval = ReadMPU9250Data( rawAcelTempGy );
    if( retval != OK )
    {
        _err("Failed to read MPU9250\n");
        return;
    }

    /* Currently, we leave out the bias */

    /* Now we'll calculate the accleration value into actual g's */
    /*ax = (float)rawAcelTempGy[0]*A_FACTOR - fAccelBias[0];  // get actual g value, this depends on scale being set
    ay = (float)rawAcelTempGy[1]*A_FACTOR - fAccelBias[1];   
    az = (float)rawAcelTempGy[2]*A_FACTOR - fAccelBias[2];  
    */
    ax = (float)rawAcelTempGy[0] * A_FACTOR;  /* get actual g value, this depends on scale being set */
    ay = (float)rawAcelTempGy[1] * A_FACTOR;   
    az = (float)rawAcelTempGy[2] * A_FACTOR;  
   
    /* Calculate the gyro value into actual degrees per second */
    gx = (float)rawAcelTempGy[4] * G_FACTOR * DEG_TO_RAD;  /* get actual gyro value, this depends on scale being set */
    gy = (float)rawAcelTempGy[5] * G_FACTOR * DEG_TO_RAD;  
    gz = (float)rawAcelTempGy[6] * G_FACTOR * DEG_TO_RAD;   

    retval = ReadMagData( rawMag );
    if( retval != OK )
    {
        _err("Failed to read Magneto meter\n");
        return;
    }
     /*mx = (float)magCount[0]*M_FACTOR*fMagneticAdjFactor[0] - magBias[0];
    my = (float)magCount[1]*M_FACTOR*fMagneticAdjFactor[1] - magBias[1];  
    mz = (float)magCount[2]*M_FACTOR*fMagneticAdjFactor[2] - magBias[2];  
    mx *= magScale[0];
    my *= magScale[1];
    mz *= magScale[2]; 
    */
    mx = (float)rawMag[0] * M_FACTOR * fMagneticAdjFactor[0];  // get actual magnetometer value, this depends on scale being set
    my = (float)rawMag[1] * M_FACTOR * fMagneticAdjFactor[1];  
    mz = (float)rawMag[2] * M_FACTOR * fMagneticAdjFactor[2];  

    /* Update time period */
    now = millis();
    tick_count += (now - lastupdate);
    delta_s = (float)(now - lastupdate) * 0.001f;  /* Convert to second */
    lastupdate = now;

    /*
     * THe convension of orientation in the Earth frame used here is 
     * NED (Norith-Easr-Down), where positive x-axis points to the north, 
     * positive y-axis points to the east, and positive z-axis points downward.
     * NED convension specifies the sensor direction with respect to
     * local frame to be positive x-axis pointed to the head of the vehicle,
     * positive y-axis pointed to the right of the vehicle, and positive
     * z-axis pointed down.
     * Data from each sensors (i.e., Gyro, Accelero, and Magneto) must
     * be adjusted to align with the NED direction before fed into 
     * fusion function.
     * ---------------------------------------------------------------
     * For the MPU9250 SparkFun breakout mounted underneath the PTTEP
     * robot platform (up-side down mounting). The circuit mounted makes 
     * the accelerometer axes already aligned to the correct direction. 
     * This mounting also makes the rotational data from gyroscope algned
     * with the convensional NED standard. However, the magnetic sensor
     * has different alignment. With this mounting configuration, x-axis 
     * is swapped with y-axis. The z-axis, also, points to the reverse direction.
     * Therefore, we need to realign the parameters passed to 
     * the fusion function as followed.
     */
    /* 
     * Normally, the bias of accelerometer is negative meaning that when
     * the sensor place horizontally flat (accel +z is up). The measurement
     * is 1G pointing in the opposite direction of +z (i.e., down). Also,
     * all other axes. Therefore, we negate all value to get correct bias
     * according to the gravity.
     */
    ax = -ax;
    ay = -ay;
    az = -az;
    MadgwickQuaternionUpdate( ax, ay, az, gx, gy, gz, my, mx, -mz );

