Pongkemon01/ServoCoordinator/Software/nuttx/boards/arm/stm32f7/coordinator/src/mpu9250.c
    /* Define output variables from updated quaternion---these are Tait-Bryan 
     * angles, commonly used in aircraft orientation. In this coordinate system, 
     * the positive z-axis is down toward Earth. 
     * ---
     * Yaw is the angle between Sensor x-axis and Earth magnetic North 
     ๕ (or true North if corrected for local declination, looking down from 
     ๕ the sensor positive yaw is counterclockwise.
     * ---
     * Pitch is angle between sensor x-axis and Earth ground plane, 
     * toward the Earth is positive, up toward the sky is negative.
     * ---
     * Roll is angle between sensor y-axis and Earth ground plane, y-axis up 
     * is positive roll.
     * ---
     * These arise from the definition of the homogeneous rotation matrix 
     * constructed from quaternions. Tait-Bryan angles as well as Euler angles 
     * are non-commutative; that is, the get the correct orientation 
     * the rotations must be applied in the correct order which for this 
     * configuration is yaw, pitch, and then roll. For more see 
     * http://en.wikipedia.org/wiki/Conversion_between_quaternions_and_Euler_angles 
     * which has additional links.
     */

    /* compensate the accelerometer readings from gravity.  */
    a31 = 2.0f * ( ( fQuaternion[0] * fQuaternion[1] ) + ( fQuaternion[2] * fQuaternion[3] ) );
    a32 = 2.0f * ( ( fQuaternion[1] * fQuaternion[3] ) - ( fQuaternion[0] * fQuaternion[2] ) );
    a33 = ( fQuaternion[0] * fQuaternion[0] ) - ( fQuaternion[1] * fQuaternion[1] ) - 
            ( fQuaternion[2] * fQuaternion[2] ) + ( fQuaternion[3] * fQuaternion[3] );

    LinearAcel.x = ax - a32;
    LinearAcel.y = ay - a31;
    LinearAcel.z = az - a33;


    /* For debug information, generate log every 0.5 second */
    if( tick_count >= 500 )
    {
        tick_count = 0;
        _info( " - Quaternion: %f + %fi + %fj + %fk\n", fQuaternion[0], fQuaternion[1], fQuaternion[2], fQuaternion[3] );
        _info( " - Linear accel x=%f, y=%f, z=%f\n", LinearAcel.x, LinearAcel.y, LinearAcel.z );
    }
}

/************************************************************************************
 * Driver interface
 ************************************************************************************/

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int     imu_open(FAR struct file *filep);
static int     imu_close(FAR struct file *filep);
static ssize_t imu_read(FAR struct file *filep, FAR char *buffer, size_t buflen);
static ssize_t imu_write(FAR struct file *filep, FAR const char *buffer, size_t buflen);
static int     imu_ioctl(FAR struct file *filep, int cmd, unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct file_operations g_imuops =
{
    imu_open,  /* open */
    imu_close, /* close */
    imu_read,  /* read */
    imu_write, /* write */
    NULL,        /* seek */
    imu_ioctl, /* ioctl */
    NULL         /* poll */
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/************************************************************************************
 * Name: imu_open
 *
 * Description:
 *   This function is called whenever the motor device is opened.
 *
 ************************************************************************************/

static int imu_open(FAR struct file *filep)
{
    /* Do nothing, just return OK */
    return OK;
}

/************************************************************************************
 * Name: imu_close
 *
 * Description:
 *   This function is called when the motor device is closed.
 *
 ************************************************************************************/

static int imu_close(FAR struct file *filep)
{
    /* Do nothing, just return OK */
    return OK;
}

/************************************************************************************
 * Name: imu_read
 *
 * Description:
*   A dummy read method.  This is provided only to satsify the VFS layer.
  *
 ************************************************************************************/

static ssize_t imu_read(FAR struct file *filep, FAR char *buf, size_t buflen)
{
    /* return nothing */

    return 0;
}

/************************************************************************************
 * Name: imu_write
 *
 * Description:
 *   A dummy write method.  This is provided only to satsify the VFS layer.
 *
 ************************************************************************************/

static ssize_t imu_write(FAR struct file *filep, FAR const char *buf, size_t buflen)
{
    /* Return a failure */

    return -EPERM;
}

/************************************************************************************
 * Name: imu_ioctl
 *
 * Description:
 *   The standard ioctl method.  This is where ALL of the motor work is done.
 *
 ************************************************************************************/

static int imu_ioctl(FAR struct file *filep, int cmd, unsigned long arg)
{
    int     ret;
    float*  fp;

    _info("IMU Cmd: %d arg: %ld\n", cmd, arg);

    switch (cmd)
    {
        case IMU_CMD_GET_SAMPLE_RATE: /* Arg: Pointer to uint32_t */
            *((uint32_t*)arg) = SAMPLE_RATE;
            break;

        case IMU_CMD_GET_QUATERNION: /* Arg: Array float[4] */
            fp = (float*)arg;
            fp[0] = fQuaternion[0];
            fp[1] = fQuaternion[1];
            fp[2] = fQuaternion[2];
            fp[3] = fQuaternion[3];
            break;

        //case IMU_CMD_GET_TAIT_BRYAN: /* Arg: Array float[3] for yaw/pitch/roll */
        //    fp = (float*)arg;
        //    fp[0] = EulerAngle.yaw;
        //    fp[1] = EulerAngle.pitch;
        //    fp[2] = EulerAngle.roll;
        //    break;

