Pongkemon01/ServoCoordinator/Software/nuttx/boards/arm/stm32f7/coordinator/src/mpu9250.c
        case IMU_CMD_GET_LIN_ACCEL: /* Arg: Array float[3] for x/y/z */
            fp = (float*)arg;
            fp[0] = LinearAcel.x;
            fp[1] = LinearAcel.y;
            fp[2] = LinearAcel.z;
            break;

        /* Any unrecognized IOCTL commands might be platform-specific ioctl commands */
        default:
            _err("Unrecognized cmd: %d arg: %ld\n", cmd, arg);
            ret = -ENOTSUP;
            break;
    }

  return ret;
}

/************************************************************************************
 * Pubic Functions
 ************************************************************************************/
int imu_initialize(void)
{
    float deviation[6];

    _info("Initialize IMU:..");

    /* 1. Init I2C */
    if( ( i2c_bus = stm32_i2cbus_initialize(I2C_CHANNEL) ) == NULL )
    {
        _err("Failed to init i2c\n");
        return -ENOTSUP;
    }

    /* 2. Init the sensors */
    MPUSelfTest( deviation );
    for( int i = 0; i < 3; i++ )
    {
        _info( "Accelerometer axis %d has deviation %f\n", i, deviation[i] );
        _info( "Gyroscope axis %d has deviation %f\n", i, deviation[i+3] );
    }
    CalibrateAccelGyro();
    if( InitMPU9250() != OK )
    {
        _err("Failed to initialize IMU\n");
        stm32_i2cbus_uninitialize( i2c_bus );
        i2c_bus = NULL;
        return -ENOTSUP;
    }

    /* 3. Register timer event */
    if( work_queue(MPU_WORK_QUEUE, &worker, UpdateData, NULL, SAMPLE_PERIOD) != OK )
    {
        _err("Unable to register IMU to work queue\n");
        stm32_i2cbus_uninitialize( i2c_bus );
        i2c_bus = NULL;
        return -ENOTSUP;
    }

    /* 4. Register the driver  */
    if( register_driver( "/dev/imu", &g_imuops, 0666, NULL ) != OK )
    {
        _err("Unable to register /dev/imu\n");
        stm32_i2cbus_uninitialize( i2c_bus );
        i2c_bus = NULL;
        return -ENOTSUP;
    }
  _info("DONE\n");
  return OK;
}
